app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (name LIKE '%%' OR email LIKE '%%' OR phone LIKE '%%' OR cpf LIKE '%%')
---
  def index
    @users = User.where("name LIKE ? OR email LIKE ? OR phone LIKE ? OR cpf LIKE ?", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%")

INSERT INTO "users" ("name", "email", "phone", "cpf", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "layse"], ["email", "layse@gmail.com"], ["phone", "81988702652"], ["cpf", "00000000000"], ["created_at", "2023-10-06 20:22:12.637510"], ["updated_at", "2023-10-06 20:22:12.637510"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save